{
    "modelTopology": {
        "class_name": "Model",
        "config": {
            "name": "decoder",
            "layers": [
                {
                    "name": "decoder_input",
                    "class_name": "InputLayer",
                    "config": {
                        "batch_input_shape": [
                            null,
                            5
                        ],
                        "dtype": "float32",
                        "sparse": false,
                        "name": "decoder_input"
                    },
                    "inbound_nodes": []
                },
                {
                    "name": "dense_Dense1",
                    "class_name": "Dense",
                    "config": {
                        "units": 97152,
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "VarianceScaling",
                            "config": {
                                "scale": 1,
                                "mode": "fan_avg",
                                "distribution": "normal",
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null,
                        "name": "dense_Dense1",
                        "trainable": true
                    },
                    "inbound_nodes": [
                        [
                            [
                                "decoder_input",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "name": "reshape_Reshape1",
                    "class_name": "Reshape",
                    "config": {
                        "target_shape": [
                            33,
                            46,
                            64
                        ],
                        "name": "reshape_Reshape1",
                        "trainable": true
                    },
                    "inbound_nodes": [
                        [
                            [
                                "dense_Dense1",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "name": "conv2d_transpose_Conv2DTranspose1",
                    "class_name": "Conv2DTranspose",
                    "config": {
                        "filters": 64,
                        "kernel_initializer": {
                            "class_name": "VarianceScaling",
                            "config": {
                                "scale": 1,
                                "mode": "fan_avg",
                                "distribution": "normal",
                                "seed": null
                            }
                        },
                        "kernel_regularizer": null,
                        "kernel_constraint": null,
                        "kernel_size": [
                            3,
                            3
                        ],
                        "strides": [
                            1,
                            1
                        ],
                        "padding": "valid",
                        "data_format": "channels_last",
                        "activation": "relu",
                        "use_bias": true,
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "bias_constraint": null,
                        "name": "conv2d_transpose_Conv2DTranspose1",
                        "trainable": true
                    },
                    "inbound_nodes": [
                        [
                            [
                                "reshape_Reshape1",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "name": "up_sampling2d_UpSampling2D1",
                    "class_name": "UpSampling2D",
                    "config": {
                        "size": [
                            2,
                            2
                        ],
                        "data_format": "channels_last",
                        "interpolation": "nearest",
                        "name": "up_sampling2d_UpSampling2D1",
                        "trainable": true
                    },
                    "inbound_nodes": [
                        [
                            [
                                "conv2d_transpose_Conv2DTranspose1",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "name": "conv2d_transpose_Conv2DTranspose2",
                    "class_name": "Conv2DTranspose",
                    "config": {
                        "filters": 64,
                        "kernel_initializer": {
                            "class_name": "VarianceScaling",
                            "config": {
                                "scale": 1,
                                "mode": "fan_avg",
                                "distribution": "normal",
                                "seed": null
                            }
                        },
                        "kernel_regularizer": null,
                        "kernel_constraint": null,
                        "kernel_size": [
                            3,
                            3
                        ],
                        "strides": [
                            1,
                            1
                        ],
                        "padding": "valid",
                        "data_format": "channels_last",
                        "activation": "relu",
                        "use_bias": true,
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "bias_constraint": null,
                        "name": "conv2d_transpose_Conv2DTranspose2",
                        "trainable": true
                    },
                    "inbound_nodes": [
                        [
                            [
                                "up_sampling2d_UpSampling2D1",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "name": "up_sampling2d_UpSampling2D2",
                    "class_name": "UpSampling2D",
                    "config": {
                        "size": [
                            2,
                            2
                        ],
                        "data_format": "channels_last",
                        "interpolation": "nearest",
                        "name": "up_sampling2d_UpSampling2D2",
                        "trainable": true
                    },
                    "inbound_nodes": [
                        [
                            [
                                "conv2d_transpose_Conv2DTranspose2",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "name": "conv2d_transpose_Conv2DTranspose3",
                    "class_name": "Conv2DTranspose",
                    "config": {
                        "filters": 64,
                        "kernel_initializer": {
                            "class_name": "VarianceScaling",
                            "config": {
                                "scale": 1,
                                "mode": "fan_avg",
                                "distribution": "normal",
                                "seed": null
                            }
                        },
                        "kernel_regularizer": null,
                        "kernel_constraint": null,
                        "kernel_size": [
                            3,
                            3
                        ],
                        "strides": [
                            1,
                            1
                        ],
                        "padding": "valid",
                        "data_format": "channels_last",
                        "activation": "relu",
                        "use_bias": true,
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "bias_constraint": null,
                        "name": "conv2d_transpose_Conv2DTranspose3",
                        "trainable": true
                    },
                    "inbound_nodes": [
                        [
                            [
                                "up_sampling2d_UpSampling2D2",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "name": "conv2d_transpose_Conv2DTranspose4",
                    "class_name": "Conv2DTranspose",
                    "config": {
                        "filters": 9,
                        "kernel_initializer": {
                            "class_name": "VarianceScaling",
                            "config": {
                                "scale": 1,
                                "mode": "fan_avg",
                                "distribution": "normal",
                                "seed": null
                            }
                        },
                        "kernel_regularizer": null,
                        "kernel_constraint": null,
                        "kernel_size": [
                            3,
                            3
                        ],
                        "strides": [
                            1,
                            1
                        ],
                        "padding": "valid",
                        "data_format": "channels_last",
                        "activation": "relu",
                        "use_bias": true,
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "bias_constraint": null,
                        "name": "conv2d_transpose_Conv2DTranspose4",
                        "trainable": true
                    },
                    "inbound_nodes": [
                        [
                            [
                                "conv2d_transpose_Conv2DTranspose3",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "name": "conv2d_transpose_Conv2DTranspose5",
                    "class_name": "Conv2DTranspose",
                    "config": {
                        "filters": 3,
                        "kernel_initializer": {
                            "class_name": "VarianceScaling",
                            "config": {
                                "scale": 1,
                                "mode": "fan_avg",
                                "distribution": "normal",
                                "seed": null
                            }
                        },
                        "kernel_regularizer": null,
                        "kernel_constraint": null,
                        "kernel_size": [
                            3,
                            3
                        ],
                        "strides": [
                            1,
                            1
                        ],
                        "padding": "valid",
                        "data_format": "channels_last",
                        "activation": "linear",
                        "use_bias": true,
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "bias_constraint": null,
                        "name": "conv2d_transpose_Conv2DTranspose5",
                        "trainable": true
                    },
                    "inbound_nodes": [
                        [
                            [
                                "conv2d_transpose_Conv2DTranspose4",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "name": "cropping2d_Cropping2D1",
                    "class_name": "Cropping2D",
                    "config": {
                        "cropping": [
                            [
                                0,
                                0
                            ],
                            [
                                1,
                                1
                            ]
                        ],
                        "data_format": "channels_last",
                        "name": "cropping2d_Cropping2D1",
                        "trainable": true
                    },
                    "inbound_nodes": [
                        [
                            [
                                "conv2d_transpose_Conv2DTranspose5",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                }
            ],
            "input_layers": [
                [
                    "decoder_input",
                    0,
                    0
                ]
            ],
            "output_layers": [
                [
                    "cropping2d_Cropping2D1",
                    0,
                    0
                ]
            ]
        },
        "keras_version": "tfjs-layers 4.1.0",
        "backend": "tensor_flow.js"
    },
    "weightsManifest": [
        {
            "paths": [
                "decoderWeights-rgb.bin"
            ],
            "weights": [
                {
                    "name": "dense_Dense1/kernel",
                    "shape": [
                        5,
                        97152
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_Dense1/bias",
                    "shape": [
                        97152
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_transpose_Conv2DTranspose1/kernel",
                    "shape": [
                        3,
                        3,
                        64,
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_transpose_Conv2DTranspose1/bias",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_transpose_Conv2DTranspose2/kernel",
                    "shape": [
                        3,
                        3,
                        64,
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_transpose_Conv2DTranspose2/bias",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_transpose_Conv2DTranspose3/kernel",
                    "shape": [
                        3,
                        3,
                        64,
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_transpose_Conv2DTranspose3/bias",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_transpose_Conv2DTranspose4/kernel",
                    "shape": [
                        3,
                        3,
                        9,
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_transpose_Conv2DTranspose4/bias",
                    "shape": [
                        9
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_transpose_Conv2DTranspose5/kernel",
                    "shape": [
                        3,
                        3,
                        3,
                        9
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_transpose_Conv2DTranspose5/bias",
                    "shape": [
                        3
                    ],
                    "dtype": "float32"
                }
            ]
        }
    ],
    "format": "layers-model",
    "generatedBy": "TensorFlow.js tfjs-layers v4.1.0",
    "convertedBy": null
}
