{"modelTopology":{"class_name":"Model","config":{"name":"model2","layers":[{"name":"decoder_input","class_name":"InputLayer","config":{"batch_input_shape":[null,16],"dtype":"float32","sparse":false,"name":"decoder_input"},"inbound_nodes":[]},{"name":"dense_Dense1","class_name":"Dense","config":{"units":3872,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true},"inbound_nodes":[[["decoder_input",0,0,{}]]]},{"name":"reshape_Reshape1","class_name":"Reshape","config":{"target_shape":[11,11,32],"name":"reshape_Reshape1","trainable":true},"inbound_nodes":[[["dense_Dense1",0,0,{}]]]},{"name":"conv2d_transpose_Conv2DTranspose1","class_name":"Conv2DTranspose","config":{"filters":32,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"valid","data_format":"channels_last","activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_transpose_Conv2DTranspose1","trainable":true},"inbound_nodes":[[["reshape_Reshape1",0,0,{}]]]},{"name":"up_sampling2d_UpSampling2D1","class_name":"UpSampling2D","config":{"size":[2,2],"data_format":"channels_last","interpolation":"nearest","name":"up_sampling2d_UpSampling2D1","trainable":true},"inbound_nodes":[[["conv2d_transpose_Conv2DTranspose1",0,0,{}]]]},{"name":"conv2d_transpose_Conv2DTranspose2","class_name":"Conv2DTranspose","config":{"filters":1,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"valid","data_format":"channels_last","activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_transpose_Conv2DTranspose2","trainable":true},"inbound_nodes":[[["up_sampling2d_UpSampling2D1",0,0,{}]]]}],"input_layers":[["decoder_input",0,0]],"output_layers":[["conv2d_transpose_Conv2DTranspose2",0,0]]},"keras_version":"tfjs-layers 4.1.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense1/kernel","shape":[16,3872],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[3872],"dtype":"float32"},{"name":"conv2d_transpose_Conv2DTranspose1/kernel","shape":[3,3,32,32],"dtype":"float32"},{"name":"conv2d_transpose_Conv2DTranspose1/bias","shape":[32],"dtype":"float32"},{"name":"conv2d_transpose_Conv2DTranspose2/kernel","shape":[3,3,1,32],"dtype":"float32"},{"name":"conv2d_transpose_Conv2DTranspose2/bias","shape":[1],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.1.0","convertedBy":null}